&НаКлиенте
&После("Зарегистрировать")
Процедура ЗарегистрироватьПосле(Команда)
	
	//+++ нна 24092026 ФУ
	Если Строка(Объект.ВидДокумента.УникальныйИдентификатор()) = "a963c455-a1c9-11eb-b511-a7abe965c408" Тогда
		ВыгрузитьСчетВБП();
		Элементы.ОтправитьОбъекты.Доступность = Ложь;
		УстановитьСостояниеНаСогласовании();
	КонецЕсли;
	//---
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеНаСогласовании()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСостояния = Новый Структура("Состояние, Установил, Период, НачальноеСостояние",
		Перечисления.СостоянияДокументов.НаСогласовании,
		ПользователиКлиентСервер.ТекущийПользователь(),
		ТекущаяДатаСеанса(),
		Перечисления.СостоянияДокументов.ПустаяСсылка());
	
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(СтруктураСостояния);
	ИзменитьСостояние(Объект.Ссылка, МассивСостояний);
	
КонецПроцедуры
